Public Member Functions | Friends | List of all members
IFCAPI::v1::ObjectID Class Referencefinal
IFC Data Access
Identifies an IFC entity (e.g: IfcBuildingStorey, IfcBeam, IfcZone, etc.) More...
#include <IFCObjectID.hpp>
 Inheritance diagram for IFCAPI::v1::ObjectID:
 Public Member Functions
ULong  | GenerateHashValue () const
For use as Hash key.
bool  | operator== (const IFCAPI::v1::ObjectID &other) const
Equality operator.
bool  | operator!= (const IFCAPI::v1::ObjectID &other) const
Inequality operator.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Assignments
 class  | HookAssignments
 class  | HookDataProvider
 class  | ObjectAccessor
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Identifies an IFC entity (e.g: IfcBuildingStorey, IfcBeam, IfcZone, etc.)
Since
Archicad 28
Remarks
Use it to query additional IFC related information for the specific entity.